/*СРАВНЕНИЯ
— использовать строгую проверку на равенство для нал и андефайн
— не использовать нал и андефайн в сравнении

Резюме
- Операторы сравнения возвращают логическое значение.
- Строки сравниваются по буквам в «словаре».
- Когда сравниваются значения разных типов, они преобразуются в числа (исключая строгую проверку равенства).
- Значения «null» и «undefined» равны «==» друг другу и не равны никакому другому значению.
- будьте осторожны при использовании сравнений типа '>' или '<' с переменными, которые иногда могут быть «null / unefined». Сделать отдельную проверку для «null / undefined» - хорошая идея.*/

/*Task
true +
false +
true +
true +
false +
true -
false +
*/